<script setup>
import { ref } from 'vue'
const menu = ref([
  {
    id: 1,
    品項: '珍珠奶茶',
    描敘: '香濃奶茶搭配QQ珍珠',
    價格: 50,
    庫存: 20
  },
  {
    id: 2,
    品項: '冬瓜檸檬',
    描敘: '清新冬瓜配上新鮮檸檬',
    價格: 45,
    庫存: 18
  },
  {
    id: 3,
    品項: '翡翠檸檬',
    描敘: '綠茶與檸檬的完美結合',
    價格: 55,
    庫存: 34
  },
  {
    id: 4,
    品項: '四季春茶',
    描敘: '香醇四季春茶，回甘無比',
    價格: 45,
    庫存: 10
  },
  {
    id: 5,
    品項: '阿薩姆奶茶',
    描敘: '阿薩姆紅茶搭配香醇鮮奶',
    價格: 50,
    庫存: 25
  },
  {
    id: 6,
    品項: '檸檬冰茶',
    描敘: '檸檬與冰茶的清新組合',
    價格: 45,
    庫存: 20
  },
  {
    id: 7,
    品項: '芒果綠茶',
    描敘: '芒果與綠茶的獨特風味',
    價格: 55,
    庫存: 18
  },
  {
    id: 8,
    品項: '抹茶拿鐵',
    描敘: '抹茶與鮮奶的絕配',
    價格: 60,
    庫存: 20
  }
])
</script>

<template>
  {{ menu }}
</template>

<style scoped></style>
